In [1]:
import pandas as pd
import numpy as np

In [3]:
df = pd.read_csv("../csv-archivos/employees.csv", index_col=0)
df

      employee_number gender  date_birth
0                 162      m        1972
1                 259      m        1971
2                 319      m        1981
5                1900      f        1975
6                  81      f        1964
...               ...    ...         ...
1568             3637      f        1995
1569             3638      f        1997
1574             3643      f        1992
1577             3646      m        1984
1579             3648      m        1977

[1580 rows x 3 columns]

In [3]:
employee_number = df["employee_number"]

In [4]:
gender = df["gender"]

In [5]:
date_birth = df["date_birth"]

In [2]:
import mysql.connector
from mysql.connector import errorcode

In [ ]:
cnx = mysql.connector.connect(user='root', password='AlumnaAdalab',
                              host='127.0.0.1', database='abc_company')

mycursor = cnx.cursor()
query = "INSERT INTO peliculas (puntuacion_imbd, puntuacion_rt, direccion, guionistas, argumento, duracion_minutos, nombre_pelicula, codigo_imbd) VALUES (%s, %s, %s, %s, %s, %s, %s, %s)"
val = lista_definitiva
try: 
    mycursor.executemany(query, val)
    cnx.commit()
    print(mycursor.rowcount, "registro/s insertado/s.")
except mysql.connector.Error as err:
    print(err)
    print("Error Code:", err.errno)
    print("SQLSTATE", err.sqlstate)
    print("Message", err.msg)